package JavaStudy01;

import java.util.Scanner;

/*
 패키지란?
 클래스를 기능별로 묶어서 그룹 이름을 붙여 놓은 것
 - 파일들을 관리하기 위해 사용하는 폴더(디렉토리)와 비슷한 개념
 - 패키지의 물리적인 형태는 파일 시스템의 폴더
 
 클래스 이름의 일부
 - 클래스를 유일하게 만들어주는 식별자
 - 전체 클래스 이름 = 상위패키지.하위패키지.클래스
 - 클래스명이 같아도 패키지명이 다르면 다른 클래스로 취급
 
 import문
 - 미리 생성된(기존에 만들어진) 클래스를 사용하기 위해 로딩하는 명령어
 - 패키지가 다른 클래스를 사용해야 하는 경우 활용
 - 클래스명이 중복되는 경우 하나는 클래스명을 쓰고 나머지 하나는 전체 패키지.클래스명을 써서 구분한다!
 
 */



public class Java24 {

	public static void main(String[] args) {
//		패키지가 다른 클래스를 사용하는 경우 활용!
		Scanner sc = new Scanner(System.in);
	}

}
